Certification/src/DataProcessors/ЗагрузкаКонтрагентовExel/ЗагрузкаКонтрагентовExel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКонтрагентовExel</name>
  <tabularSections>
    <name>ТаблицаКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Certification/src/DataProcessors/ЗагрузкаКонтрагентовExel/ObjectModule.bsl
Процедура СоздатьКонтрагентов() Экспорт

	Для Каждого СтрокаРезультат из ТаблицаКонтрагентов Цикл
		ЭлементСпр = Справочники.Абоненты.НайтиПоРеквизиту("ИНН",СтрокаРезультат.ИНН);
		Если ЗначениеЗаполнено(ЭлементСпр) Тогда
			Продолжить;
		КонецЕсли;	
		ОбъектСпр = Справочники.Абоненты.СоздатьЭлемент();
		ОбъектСпр.ИНН = СтрокаРезультат.ИНН;
		ОбъектСпр.Наименование = СтрокаРезультат.Контрагент;
		Попытка 
			ОбъектСпр.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка завершена";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
КонецПроцедуры
